In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
#make a series
#np.nan is null
data = Series(['one','two',np.nan,'four'])
data

0     one
1     two
2     NaN
3    four
dtype: object

In [3]:
#check if we have null
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
#drop the nulls
data.dropna()

0     one
1     two
3    four
dtype: object

In [16]:
dFrame = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])
dFrame

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [14]:
#create new dataframe - clean
#using this, you are dropping all rows with nulls (even if its 1 null value)

clean_dFrame = dFrame.dropna()
clean_dFrame

     0    1    2
0  1.0  2.0  3.0

In [18]:
dFrame

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [19]:
#specify dropping when all rows have only nulls
clean_dFrame.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0

In [20]:
#all columns got dropped 
dFrame.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [22]:
#we want dataframe with 3 points
npn = np.nan
dFrame2 = DataFrame([[1,2,3,npn],[2,npn,5,6],[npn,7,npn,9],[1,npn,npn,npn]])
dFrame2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [24]:
#threshold by number of datapoints that dont have nulls
#since the threshold is 2 nulls the last row was dropped (had 3 nulls)
dFrame2.dropna(thresh=2)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [25]:
dFrame2.dropna(thresh=3)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0

In [27]:
#you want to fill the values
#any values that had null are now 1s 
dFrame2.fillna(1)

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [28]:
#fill different values for different columns
#check frame
dFrame2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [30]:
#fill different values for different columns
#fill it with dictionairy
dFrame2.fillna({0:0,1:1,2:2,3:3})

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0

In [32]:
#modify the excisting object
#modify in place
#inplace=True allows you to modify the object for the place
dFrame2.fillna(0,inplace=True)

In [33]:
dFrame2

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0